fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоровИРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_Клиент</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполнениеРабот</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Catalog.ДоговорыКонтрагентов</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОплатаЗаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура СформироватьАктыТекущие(ДанныеЗаполнения) Экспорт

	ЭтотОбъект.СписокДоговоров.Очистить();
	
	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 	"ВЫБРАТЬ
	 	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	 	|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
	 	|	ДоговорыКонтрагентов.ВКМ_ОплатаЗаЧас КАК ВКМ_ОплатаЗаЧас,
	 	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	 	|	ДоговорыКонтрагентов.Организация КАК Организация,
	 	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	 	|ПОМЕСТИТЬ ВрТаб
	 	|ИЗ
	 	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 	|ГДЕ
	 	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	 	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	 	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	 	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот
	 	|ПОМЕСТИТЬ ВрТаб2
	 	|ИЗ
	 	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	 	|		ПО ВКМ_ОбслуживаниеКлиента.Договор <> РеализацияТоваровУслуг.Договор
	 	|ГДЕ
	 	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот >= &НАЧАЛОДата
	 	|	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот <= &КОНЕЦДата
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВрТаб.Владелец КАК Владелец,
	 	|	ВрТаб.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
	 	|	ВрТаб.ВКМ_ОплатаЗаЧас КАК ВКМ_ОплатаЗаЧас,
	 	|	ВрТаб.Наименование КАК Наименование,
	 	|	ВрТаб.Организация КАК Организация,
	 	|	ВрТаб.Ссылка КАК Ссылка,
	 	|	ВрТаб2.Клиент КАК Клиент,
	 	|	ВрТаб2.Договор КАК Договор,
	 	|	ВрТаб2.Специалист КАК Специалист,
	 	|	ВрТаб2.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	 	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор КАК Договор1,
	 	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток КАК СуммаКОплате
	 	|ИЗ
	 	|	ВрТаб КАК ВрТаб
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТаб2 КАК ВрТаб2
	 	|		ПО ВрТаб.Ссылка = ВрТаб2.Договор
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&Период, ) КАК ВКМ_ВыполненныеКлиентуРаботыОстатки
	 	|		ПО ВрТаб.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор";
	 
	 Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Клиент);
	 Запрос.УстановитьПараметр("Период", ДанныеЗаполнения.Период);
	 Запрос.УстановитьПараметр("НАЧАЛОДата", НачалоМесяца(ДанныеЗаполнения.Период));
	 Запрос.УстановитьПараметр("КОНЕЦДата", КонецМесяца(ДанныеЗаполнения.Период));
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	 	
	 	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	 	НовыйДокумент.Дата = ДанныеЗаполнения.Период;
	 	НовыйДокумент.Организация = ВыборкаДетальныеЗаписи.Клиент;
	 	НовыйДокумент.Договор = ВыборкаДетальныеЗаписи.Договор;
	 	НовыйДокумент.Контрагент = ВыборкаДетальныеЗаписи.Организация;
	 	 	
		
		Если ВыборкаДетальныеЗаписи.ВКМ_АбонентскаяПлата <> 0 Тогда
			НоваяСтрока = НовыйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.ВКМ_АбонентскаяПлата;
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СуммаКОплате <> 0 Тогда
			НоваяСтрока = НовыйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате;
		КонецЕсли;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		НоваяСтрочка = СписокДоговоров.Добавить();
		НоваяСтрочка.Договор = ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрочка.Реализация = НовыйДокумент.Договор;
		//ЗаполнитьЗначенияСвойств(НоваяСтрочка, ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти



#КонецЕсли
